#### Terraform Plan 📖 `infrastructure/github`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
data.infisical_secrets.aws_folder: Reading...
data.infisical_secrets.infisical_folder: Reading...
data.infisical_secrets.github_folder: Reading...
data.infisical_secrets.aws_folder: Read complete after 1s
data.infisical_secrets.infisical_folder: Read complete after 1s
data.infisical_secrets.github_folder: Read complete after 1s
github_repository.branch: Refreshing state... [id=branch]
github_actions_secret.infisical_client_id: Refreshing state... [id=branch:INFISICAL_CLIENT_ID]
github_actions_secret.infisical_client_secret: Refreshing state... [id=branch:INFISICAL_CLIENT_SECRET]
github_actions_secret.aws_access_key_id: Refreshing state... [id=branch:AWS_ACCESS_KEY_ID]
github_branch_default.main: Refreshing state... [id=branch]
github_actions_secret.aws_secret_access_key: Refreshing state... [id=branch:AWS_SECRET_ACCESS_KEY]
github_branch_protection.main: Refreshing state... [id=BPR_kwDOPjZxzc4D-9hQ]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_actions_secret.aws_access_key_id must be replaced
-/+ resource "github_actions_secret" "aws_access_key_id" {
      ~ created_at       = "2025-08-27 19:14:11 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "branch:AWS_ACCESS_KEY_ID" -> (known after apply)
      ~ updated_at       = "2025-08-27 19:14:11 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.aws_secret_access_key must be replaced
-/+ resource "github_actions_secret" "aws_secret_access_key" {
      ~ created_at       = "2025-08-27 19:14:12 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "branch:AWS_SECRET_ACCESS_KEY" -> (known after apply)
      ~ updated_at       = "2025-08-27 19:14:12 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.infisical_client_id must be replaced
-/+ resource "github_actions_secret" "infisical_client_id" {
      ~ created_at       = "2025-08-27 19:14:09 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "branch:INFISICAL_CLIENT_ID" -> (known after apply)
      ~ updated_at       = "2025-08-27 19:14:09 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_actions_secret.infisical_client_secret must be replaced
-/+ resource "github_actions_secret" "infisical_client_secret" {
      ~ created_at       = "2025-08-27 19:14:08 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "branch:INFISICAL_CLIENT_SECRET" -> (known after apply)
      ~ updated_at       = "2025-08-27 19:14:08 +0000 UTC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # github_branch_protection.main will be updated in-place
  ~ resource "github_branch_protection" "main" {
        id                              = "BPR_kwDOPjZxzc4D-9hQ"
        # (10 unchanged attributes hidden)

      ~ required_status_checks {
          ~ contexts = [
              + "lambda-tests",
                # (1 unchanged element hidden)
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 1 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```

</details>

*Pushed by: @denniwang, Action: `pull_request`*